Repository: zstanecic/weather_plus
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fi, hu, ru, uk

source: Find previous
fi: Etsi edellinen
hu: Előző keresése
ru: Найти Предыдущую
uk: Знайти Попередню

source: Empty file or not in cities woeID format compatible!
ru: Пустой файл или не совместим с форматом woeID городов!
uk: Порожній файл або несумісний з форматом woeID міст!

source: Be an error has occurred.
fi: On tapahtunut virhe.
hu: Hiba történt.
ru: Произошла ошибка.
uk: Виникла помилка.

source: See the log for more information.
fi: Katso lisätietoja lokista.
hu: Tekintse meg a naplót a részletekért.
ru: Для дополнительной информации смотрите журнал.
uk: Для додаткової інформації дивіться журнал.

source: Error: failure writing file!
fi: Virhe: Tiedoston kirjoittaminen epäonnistui.
hu: Hiba: A fájl írásvédett.
ru: Ошибка: не удалось записать файл!
uk: Помилка: не вдалося записати файл!

source: occurrences found
fi: esiintymää löytynyt
hu: A következők már megtalálhatók
ru: местонахождений найдено
uk: місцезнаходжень знайдено

source: for
fi: kohteelle
ru: для
uk: для

source: Choose a city.
fi: Valitse kaupunki.
hu: Válasszon ki egy várost.
ru: Выбрать город.
uk: Вибрати місто.

source: List of availables Cities
fi: Käytettävissä olevien kaupunkien luettelo
hu: Választható városok
ru: Список доступных городов
uk: Список доступних міст

source: Do not show this message again!
fi: Älä näytä tätä uudelleen
hu: Ne mutassa ismét ezt az üzenetet!
ru: Больше не показывать это сообщение!
uk: Більше не показувати це повідомлення!

source: &Install...
fi: &Asenna...
hu: &Telepítés...
ru: У&становить...
uk: У&становити...

source: Upd&ate...
fi: Pä&ivitä...
hu: &Frissítés...
ru: &Обновить...
uk: &Оновити...

source: &Close
fi: &Sulje
hu: &Bezárás
ru: &Закрыть
uk: &Закрити

source: &Uninstall...
fi: P&oista asennus...
hu: &Eltávolítás...
ru: &Удалить...
uk: &Видалити...

source: Type the search string
fi: Kirjoita haettava merkkijono
hu: Írja be a keresőszót
ru: Введите строку поиска
uk: Для пошуку введіть текст

source: Find
fi: Etsi
hu: Keresés
ru: Поиск
uk: Пошук

source: next
fi: Seuraava
hu: következő
ru: следующий
uk: наступний

source: previous
fi: Edellinen
hu: előző
ru: предыдущий
uk: попередній

source: No results next for
fi: Ei enempää hakutuloksia merkkijonolle
hu: nincs következő találat
ru: Нет следующих результатов для
uk: Немає наступних результатів для

source: No previous results for
fi: Ei edellisiä hakutuloksia merkkijonolle
hu: nincs előző találat
ru: Нет предыдущих результатов для
uk: Немає попередніх результатів для

source: &Select all
fi: Valitse k&aikki
hu: &Összes kijelölése
ru: &Выбрать все
uk: &Обрати все

source: &Deselect all
fi: Poista &kaikkien valinta
hu: &kijelölés megszűntetése
ru: &снять выделение
uk: &зняти виділення

source: not checked
fi: ei valittu
hu: nincs bejelölve
ru: не отмечен
uk: не відзначений

source: checked
fi: valittu
hu: bejelölve
ru: отмечен
uk: відзначений

source: check box
fi: valintaruutu
hu: jelölőnégyzet
ru: флажок
uk: прапорець

source: check boxes checked
fi: valintaruudut valittu
hu: jelölőnégyzet bejelölve
ru: флажки отмечены
uk: прапорці відзначені

source: check boxes not checked
fi: valintaruudut ei valittu
hu: jelölőnégyzet nincs bejelölve
ru: флажки не отмечены
uk: прапорці не відзначені

source: Saving in progress
fi: Tallennus käynnissä
hu: Mentés folyamatban
ru: Идёт сохранение
uk: Йде збереження

source: Download canceled.
fi: Lataus peruutettu.
hu: Letöltés megszakítva.
ru: Загрузка отменена.
uk: Завантаження скасовано.

source: &Copy to clipboard
fi: Kopioi &leikepöydälle
hu: &Másolás a vágólapra
ru: &Скопировать в буфер обмена
uk: &Скопіювати в буфер обміну

source: Adds local temperature and forecast 24 ours and prediction up to 9 days.
ru: Добавляет локальную температуру и прогноз на 24 часа и на 9 дней.
uk: Додає локальну температуру і прогноз на 24 години і на 9 днів.

source: NVDA+w for the current bulletin.
fi: NVDA+W: tämänhetkinen säätiedotus.
hu: NVDA+w: Aktuális hőmérséklet és időjárási viszonyok lekérdezése.
ru: NVDA+w для текущей погоды.
uk: NVDA+w для поточної погоды.

source: NVDA+shift+w for the prediction in the current 24 hours and prediction up to 9 days.
fi: NVDA+Vaihto+W: Ennuste alkaen 24 tunnin ajalle aina yhdeksään päivään saakka.
hu: NVDA+Shift+w: 24 órás időjárás-előrejelzés és a beállítás szerinti többnapos előrejelzés, maximum 9 napos.
ru: NVDA+Shift+W для прогноза на ближайшие 24 часа и на 9 дней.
uk: NVDA+Shift+W для прогнозу на найближчі 24 години і на 9 днів.

source: NVDA+shift+control+w for quickly enter a temporary city.
fi: NVDA+Vaihto+Ctrl+W: Määritä nopeasti väliaikainen kaupunki.
hu: NVDA+Shift+Ctrl+w: ideiglenes város beálítása
ru: NVDA+Shift+Control+W для временной установки города.
uk: NVDA+Shift+Control+W для тимчасової установки міста.

source: NVDA + shift + control + alt + w for open the Weather Plus settings.
fi: NVDA+Vaihto+Ctrl+Alt+W: Avaa Weather Plus -lisäosan asetukset.
hu: NVDA+shift+ctrl+alt+w: Az időjárás-előrejelző beállításai
ru: NVDA+shift+control+alt+w открывает диалог настроек Weather Plus.
uk: NVDA+Shift+Control+Alt+W відкриває діалог налаштувань Weather Plus.

source: NVDA+alt+w announces the date of the last update of the weather report.
fi: NVDA+Alt+W: Ilmoittaa sääennusteen päivitysajankohdan.
hu: NVDA+Alt+w: megadja, hogy mikor frissültek legutóbb az időjárási adatok.
ru: NVDA+alt+W информация о последнем обновлении сводки погоды.
uk: NVDA+alt+W інформація про останнє оновлення прогнозу погоди.

source: Shift+control+w alternates between Fahrenheit, Celsius and Kelvin.
fi: Vaihto+Ctrl+W: Vaihtaa fahrenheitin, celsiuksen ja kelvinin välillä.
hu: Ctrl+Shift+w: Váltás a hőmérsékleti skálák között (Fahrenheit, Celsius és Kelvin).
ru: Shift+Ctrl+W переключение между шкалой Фаренгейта, Цельсия и Кельвина.
uk: Shift+Ctrl+W переключення між шкалою Фаренгейта, Цельсія і Кельвіна.

source: For other instructions, you can also press Add-on Help button in Add-ons manager.
fi: Muita ohjeita saat painamalla Lisäosan ohje -painiketta Lisäosien hallinnassa.
hu: További információért nyomja meg a Súgó gombot a bővítménykezelőben.
ru: Для получения дополнительных инструкций, вы можете нажать кнопку "Справка" в менеджере дополнений.
uk: Для отримання додаткових інструкцій, ви можете натиснути кнопку "Довідка" в менеджері додатків.

source: Enter a City or choose one from the list, if available.
fi: Kirjoita kaupunki tai valitse se luettelosta.

source: The city
fi: Kaupunkia

source: The cities on your list are not compatible with the Weather API!
fi: Luettelossa olevat kaupungit eivät ole yhteensopivia Weather API -ohjelmointirajapinnan kanssa.

source: Sorry, I can not receive data, problems with the download page, try again later please!
fi: Valitettavasti tietojen vastaanottaminen ei onnistu, koska lataussivulla on ongelmia. Yritä myöhemmin uudelleen.

source: Sorry, I can not receive data, verify that your internet connection is active, or try again later!
fi: Valitettavasti tietojen vastaanottaminen ei onnistu. Varmista, että internet-yhteys on käytettävissä tai yritä myöhemmin uudelleen.

source: Attenction!
fi: Huomio

source: The cloudiness is
fi: Pilvisyys on

source: The precipitation is
fi: Sademäärä on

source: inches
fi: tuumaa

source: nanometers
fi: nanometriä

source: millimeters
fi: millimetriä

source: With gusts of
fi: Puuskissa

source: The cloudiness is of
fi: Pilvisyys on

source: The precipitation is of
fi: Sademäärä on

source: and the precipitation is
fi: ja sademäärä on

source: The UV radiation is of
fi: UV-säteily on

source: The moon rises at
fi: Kuu nousee kello

source: Sorry, the city is not set!
fi: Kaupunkia ei ole määritetty.

source: Sorry, the city set is not valid or contains incomplete data!
fi: Määritetty kaupunki on virheellinen tai sisältää puutteellisia tietoja.

source: Is not working properly, contains incomplete data or has been removed from the
fi: ei toimi kunnolla, sisältää puutteellisia tietoja tai se on poistettu

source: Provides the weather forecast and current temperature for 24 hours and the next %d days.
fi: Tarjoaa sääennusteen ja nykyisen lämpötilan 24 tunniksi ja seuraavaksi %d päiväksi.

source: Unspecified
fi: Ei määritetty

source: API response language:
fi: Ohjelmointirajapinnan vastauksen kieli:

source: Read &wind information
fi: Lue &tuulen tiedot

source: Add wind &gust speed
fi: Lisää tuulen nopeus &puuskissa

source: &Read atmospherical information
fi: Lue ilmake&hän tiedot

source: Add cloudiness &value
fi: Lisää pil&visyys

source: Add precipitation &value
fi: Lisää sa&demäärä

source: Add &ultraviolet radiation value
fi: Lisää &ultraviolettisäteilyn arvo

source: Read a&stronomical information
fi: Lue tähtitieteelli&set tiedot

source: Test the city validity and find the data of it.
fi: Testaa kaupungin kelvollisuus ja etsi sen tiedot.

source: Displays information about the current city.
fi: Näyttää nykyisen kaupungin tiedot.

source: By Latitude and Longitude: 48.8567,2.3508
fi: Leveys- ja pituusasteen mukaan (esim. 48.8567,2.3508):

source: By City name: Paris
fi: Kaupungin nimen mukaan (esim. Paris):

source: By City name and country: Toronto,Canada
fi: Kaupungin nimen ja maan mukaan (esim. Toronto,Canada):

source: Or Toronto,CA
fi: Tai Toronto,CA

source: By City name and region: Toronto,Ontario
fi: Kaupungin nimen ja alueen mukaan (esim. Toronto,Ontario):

source: By US zip: 10001
fi: Yhdysvaltain postinumeron mukaan (esim. 10001):

source: By UK postcode: SW1
fi: Yhdistyneen kuningaskunnan postinumeron mukaan (esim. SW1):

source: By Canada postal code: G2J
fi: Kanadan postinumeron mukaan (esim. G2J):

source: By metar:<metar code>: metar:EGLL
fi: Metar-koodin mukaan (esim. metar:EGLL):

source: By iata:<3 digit airport code>: iata:DXB
fi: Lentokenttäkoodin mukaan (esim. iata:DXB):

source: By auto:ip IP lookup: auto:ip
fi: IP-haun mukaan (esim. auto:ip):

source: By IP address (IPv4 and IPv6 supported): 100.0.0.1
fi: IP--osoitteen mukaan (tukee IPv4:ää ja IPv6:ta, esim. 100.0.0.1):

source: if there will be cities with the same name, will be listed
fi: Jos samannimisiä kaupunkeja löytyy, niistä näytetään luettelo.

source: By default, confirming a selection, is used the postal code
fi: Valinnan vahvistamiseen käytetään oletusarvoisesti postinumeroa.

source: If the postal code is not valid, will be used a text string: city, state, region
fi: Jos postinumero ei ole kelvollinen, sen sijaan käytetään merkkijonoa kaupunki, osavaltio, alue

source: You can indicate how to proceed by prefixing the following commands
fi: Voit ilmoittaa, miten edetä lisäämällä etuliitteen seuraaviin komentoihin

source: Direct (cities with the same name, will not listed), by typing D:City: D:Paris
fi: Suora (samannimisiä kaupunkeja ei näytetä) kirjoittamalla D:Kaupunki: D:Paris

source: Geographic coordinates, by typing G:City: G:Venezia
fi: Maantieteelliset koordinaatit kirjoittamalla G:Kaupunki: G:Venezia

source: Text string, by typing T:City: T:Bologna
fi: Merkkijono kirjoittamalla t:kaupunki: t:bologna

source: Try to reverse the order in the search key
fi: Yritä kääntää hakuavaimen järjestys päinvastaiseksi

source: Try to merge the name with hyphens, or separate it with separator
fi: Yritä yhdistää nimi viivoilla tai erottaa se erottimella

source: Try to change in English some parts
fi: Yritä muuttaa joitakin osia englanninkielisiksi
hu: Adja meg angolul az ország vagy régió nevét.

source: Choose search key for
fi: Valitse hakuavain

source: Unfortunately I could not recover enough data to find the city.
fi: Tietoja ei ole tarpeeksi kaupungin löytämiseen.

source: Do I try anyway?
fi: Yritetäänkö joka tapauksessa?

source: Sorry, I could not complete the installation of the sound effects!
fi: Äänitehosteiden asennusta ei voitu suorittaa.

source: Empty file or not in cities format compatible!
fi: Tiedosto tyhjä tai ei yhteensopivassa muodossa.

source: Containing incomplete data
fi: Sisältää epätäydellisiä tietoja

source: It was not possible find the acronym of "%s"!
fi: Maan "%s" lyhennettä ei löytynyt.

source: This may not allow you to get the city details.
fi: Kaupungin tietojen saaminen ei ehkä ole mahdollista.

source: Adds local temperature and forecast 24 ours and prediction up to 3 days.
fi: lisää NVDA:han paikalliset lämpötila- ja sääennusteet 24 tunnin ajalta aina 3 päivään saakka.
