Repository: zstanecic/weather_plus
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fi, hu, ru, uk

source: You have installed the Weather Plus add-on which is incompatible with this one. The new name of this add-on is Weather_Plus with an underscore. Click OK to update it.
ru: У Вас установлено дополнение Weather Plus несовместимое с этим. Новое имя этого дополнения - Weather_Plus с подчеркиванием. Нажмите OK, чтобы обновить его.
uk: У Вас встановлено додаток Weather Plus несумісний з цим. Нове ім'я цього додатку - Weather_Plus з підкресленням. Натисніть OK, щоб оновити його.

source: Update confirmation
ru: Подтверждение обновления
uk: Підтвердження оновлення

source: Fahrenheit
ru: Фаренгейта
uk: Фаренгейта

source: Celsius
ru: Цельсия
uk: Цельсія

source: Kelvin
ru: Кельвина
uk: Кельвіна

source: unknown
fi: tuntematon
hu: ismeretlen
ru: неизвестно
uk: невідомо

source: Weather Plus &Settings
fi: We&ather Plus
hu: Időjárás-előrejelző
ru: Настройки &Weather Plus
uk: Налаштування &Weather Plus

source: Show configuration items.
fi: Näytä asetuskohteet.
hu: Beállítások megjelenítése
ru: Показать элементы конфигурации.
uk: Показати елементи конфігурації.

source: Set and &manage your cities...
fi: Määritä ja &hallinnoi kaupunkeja...
hu: &Városok beállítása és kezelése
ru: &Установка и управление городами...
uk: &Установка і управління містами...

source: Displays or allows to set the current cities from a list
fi: Näyttää nykyiset kaupungit tai mahdollistaa niiden määrittämisen luettelosta
hu: Városok megjelenítése, vagy importálása egy listából
ru: Отображает или позволяет установить текущие города из списка
uk: Показує або дозволяє встановити поточні міста зі списку

source: Set a &temporary city...
fi: Määritä v&äliaikainen kaupunki...
hu: &Ideiglenes város beállítása...
ru: Установить временный город...
uk: Встановити тимчасовий місто...

source: Allows to set one temporary city from a list
fi: Mahdollistaa väliaikaisen kaupungin määrittämisen luettelosta
hu: Ideiglenes város beállítása listából
ru: Позволяет установить временный город из списка
uk: Дозволяє встановити тимчасове місто зі списку

source: &Documentation
fi: &Dokumentaatio
hu: &Súgó
ru: &Документация
uk: &Документація

source: Opens the help file for the current language
fi: Avaa ohjetiedoston nykyisellä kielellä
hu: Megnyitja a súgót a jelenlegi nyelvhez
ru: Открывает файл справки для текущего языка
uk: Відкриває файл довідки для поточної мови

source: &Check for Upgrade...
fi: Ta&rkista päivitykset...
hu: &Frissítések keresése...
ru: Проверить &обновление...
uk: Перевірити &оновлення...

source: Notify if there is an upgraded version available
fi: Ilmoita, jos uusi versio on saatavilla
hu: Figyelmeztessen, ha van új verzió
ru: Сообщать, если доступна обновленная версия
uk: Повідомляти, якщо доступна оновлена версія

source: Settings
fi: Asetukset
hu: Beállítások
ru: Настройки
uk: Налаштування

source: Preset
fi: Oletus
hu: Alapértelmezett
ru: Установить
uk: Встановити

source: None
fi: Ei mitään
hu: Nincs megadva
ru: Ничего
uk: Нічого

source: Enter a City, woeId or choose one from the list, if available.
ru: Введите название города, woeId или выберите из списка, если он доступен.
uk: Введіть назву міста, woeId або виберіть зі списку, якщо він доступний.

source: The woeID
ru: WoeID
uk: WoeID

source: assigned to
ru: назначенный
uk: призначений

source: has not been preset.
fi: ei ole asetettu oletukseksi.
hu: nem lett beállítva alapértelmezett helynek,
ru: не сохранён.
uk: не збережений.

source: Will be used in temporary mode!
fi: käytetään väliaikaistilassa.
hu: ezért ideiglenes módban lesz használva.
ru: Будет использоваться во временном режиме!
uk: Буде використовуватися в тимчасовому режимі!

source: Notice!
fi: Ilmoitus
hu: Figyelem!
ru: Внимание!
uk: Увага!

source: You have modified the list of your cities
fi: Olet muokannut kaupunkien luetteloa.
hu: Módosította a városok listáját
ru: Вы изменили список ваших городов
uk: Ви змінили список ваших міст

source: Do you want to save it?
fi: Haluatko tallentaa muutokset?
hu: Szeretné elmenteni?
ru: Хотите его сохранить?
uk: Бажаєте його зберегти?

source: The cities on your list are not compatible with the Yahoo API!
ru: Города в вашем списке не совместимы с API Yahoo!
uk: Міста у вашому списку не сумісні з API Yahoo!

source: They have to be tested and validated, you can do it from the addon settings window.
fi: Ne on testattava ja todennettava. Voit tehdä sen lisäosan asetusikkunasta.
hu: Ellenőrizni és hitelesíteni kell őket! Ezt megteheti a bővítmény beállításai közt.
ru: Они должны быть протестированы и проверены, вы можете сделать это из окна настроек аддона.
uk: Вони повинні бути перевірені та перевірені, ви можете зробити це з вікна налаштувань аддона.

source: Setting up a temporary city
fi: Väliaikaisen kaupungin määrittäminen
hu: Ideiglenes város beállítása
ru: Настроить временный город
uk: Налаштувати тимчасове місто

source: Cities List available:
fi: Kaupunkiluetteloita käytettävissä:
hu: Elérhető városok
ru: Список доступных городов:
uk: Список доступних міст:

source: Documentation not available for the current language!
fi: Dokumentaatiota ei ole saatavilla nykyisellä kielellä.
hu: Nincs súgó a jelenlegi nyelven.
ru: Документация не доступна для текущего языка!
uk: Документація недоступна для поточної мови!

source: Sorry, i can not receive data, verify that your internet connection is active, or try again later!
ru: К сожалению, невозможно получить данные, убедитесь, что ваше интернет-соединение активно или повторите попытку позже!
uk: На жаль, неможливо отримати дані, переконайтеся, що ваше інтернет-з'єднання активно або спробуйте ще раз!

source: version
fi: Versio
hu: Verzió
ru: версия
uk: версія

source: is available.
fi: on saatavilla.
hu: elérhető.
ru: доступна.
uk: доступна.

source: Installed version
fi: Asennettu versio
hu: Telepített verzió
ru: Установленная версия
uk: Встановлена версія

source: Do you want to download and install it?
fi: Haluatko ladata ja asentaa sen?
hu: Szeretné letölteni és telepíteni?
ru: Вы хотите загрузить и установить его?
uk: Ви хочете завантажити і встановити його?

source: Sorry, at the time an update is not available.
fi: Päivitystä ei ole tällä hetkellä saatavilla.
hu: Jelenleg nincs elérhető frissítés.
ru: К сожалению, на данный момент обновление не доступно.
uk: На жаль, на даний момент оновлення не доступно.

source: not found!
fi: ei löydy.
hu: Nem található!
ru: не найден!
uk: не знайден!

source: You need to upgrade the sound effects by reactivating the appropriate option from the settings of
fi: Äänitehosteet on päivitettävä valitsemalla asianmukainen vaihtoehto asetuksista
hu: Frissítenie kell a hangeffekteket a beállítás újboli bekapcsolásával.
ru: Вам необходимо обновить звуковые эффекты, для чего необходимо активизировать соответствующую опцию в настройках
uk: Вам необхідно оновити звукові ефекти, для чого треба активізувати відповідну опцію в налаштуваннях

source: But if these are already updated, then you need to update
fi: Jos ne on kuitenkin jo päivitetty, sitten sinun on päivitettävä
hu: Akkor is ha ezek korábban már frissítve lettek.
ru: Но если они уже обновлены, то вам нужно обновить
uk: Але якщо вони вже оновлені, то вам потрібно оновити

source: I can not load the settings!
fi: Asetuksia ei voi ladata.
hu: Nem tudom betölteni a beállításokat!
ru: Не могу загрузить настройки!
uk: Не можу завантажити налаштування!

source: I can not save the settings!
fi: Asetuksia ei voi tallentaa.
hu: Nem tudom elmenteni a beállításokat!
ru: Не могу сохранить настройки!
uk: Не можу зберегти налаштування!

source: invalid name
fi: Virheellinen nimi
hu: Érvénytelen név
ru: недопустимое имя
uk: неприпустиме ім'я

source: miles
fi: mailia
hu: mérföld
ru: миль
uk: миль

source: millimeters of mercury
fi: elohopeamillimetriä
hu: higanymilliméter
ru: миллиметров ртутного столба
uk: міліметрів ртутного стовпа

source: inches of mercury
fi: elohopeatuumaa
hu: higanyhüvelyk
ru: дюймы ртутного столба
uk: дюйми ртутного стовпа

source: kilometers
fi: kilometriä
hu: Kilométer
ru: километров
uk: кілометрів

source: millibars
fi: millibaaria
hu: Millibár
ru: миллибаров
uk: міллібарів

source: the weather report is currently
fi: Sää on tällä hetkellä
hu: Az időjárás
ru: сейчас
uk: зараз

source: degrees
fi: astetta
hu: Fok
ru: градусов
uk: градуси

source: The wind direction is from
fi: Tuulen suunta on
hu: A szél iránya
ru: Ветер
uk: Вітер

source: with speed of
fi: ja nopeus on
hu: sebessége
ru: скорость
uk: швидкість

source: The wind speed is
fi: Tuulen nopeus on
hu: A szél sebessége
ru: Скорость ветра
uk: Швидкість вітру

source: The perceived temperature is
fi: Tunnettu lämpötila on
hu: A hőérzet
ru: Воспринимаемая температура
uk: Сприймається температура

source: steady
ru: нормальное
uk: нормальний

source: rising
ru: выше нормы
uk: вище норми

source: falling
ru: ниже нормы
uk: нище норми

source: The humidity is
fi: Kosteus on
hu: a páratartalom
ru: Влажность
uk: Вологість

source: and the visibility is up to
fi: ja näkyvyys on
hu: és a látótávolság
ru: видимость
uk: видимість

source: The visibility is up to
fi: Näkyvyys on
hu: a látótávolság
ru: Видимость
uk: Видимість

source: The pressure is
fi: Ilmanpaine on
hu: a légnyomás
ru: Давление
uk: Тиск

source: and the state of the barometric pressure is
ru: барометрическое давление
uk: барометричний тиск

source: The state of the barometric pressure is
ru: Барометрическое давление
uk: Барометричний тиск

source: The sun rises at
fi: Aurinko nousee kello
hu: napkelte
ru: Восход солнца в
uk: Схід сонця в

source: and sets at
fi: ja laskee kello
hu: napnyugta
ru: заход в
uk: захід у

source: the forecast for today is
fi: Ennuste tälle päivälle on
hu: a mai előrejelzés
ru: сегодня
uk: сьогодні

source: with a maximum temperature of
fi: enimmäislämpötila on
hu: a legmagasabb hőmérséklet
ru: максимальная температура
uk: максимальна температура

source: and a minimum of
fi: ja vähimmäislämpötila
hu: és a legalacsonyabb hőmérséklet
ru: минимальная
uk: мінімальна

source: not available
fi: ei käytettävissä
hu: nem érhető el
ru: недоступно
uk: недоступно

source: In
fi: Kaupungissa
ru: В городе
uk: У місті

source: Unnamed
fi: Nimetön
hu: Névtelen
ru: Без имени
uk: Без імені

source: Sorry, the woeID is not set!
ru: К сожалению, woeID не установлен!
uk: На жаль, woeID не встановлений!

source: kilometers per hour
fi: kilometriä tunnissa
hu: Kilométer per óra
ru: километров в час
uk: кілометрів за годину

source: miles per hour
fi: mailia tunnissa
hu: Mérföld per óra
ru: миль в час
uk: миль за годину

source: in the morning
ru: утром
uk: вранці

source: in the evening
ru: вечером
uk: ввечорі

source: and
ru: и
uk: та

source: to
ru: до
uk: до

source: in the vicinity
ru: в окрестностях
uk: в околицях

source: tornado
ru: торнадо
uk: торнадо

source: tropical storm
ru: тропический шторм
uk: тропічний шторм

source: hurricane
ru: ураган
uk: ураган

source: severe thunderstorms
ru: сильные грозы
uk: сильні грози

source: mixed rain and snow
ru: дождь со снегом
uk: дощ зі снігом

source: mixed rain and hail
ru: дождь с градомм
uk: дощ з градомм

source: mixed rain and sleet
ru: дождь с мокрым снегом
uk: дощ з мокрим снігом

source: mixed snow and sleet
ru: снег и гололедица
uk: сніг і ожеледиця

source: snow flurries
ru: порывы снега
uk: пориви снігу

source: smoke
ru: туман
uk: туман

source: smoky
ru: туманно
uk: туманно

source: precipitation
ru: осадки
uk: опади

source: sunny intervals
ru: солнечные интервалы
uk: сонячні інтервали

source: sunny period
ru: солнечный период
uk: сонячний період

source: light snow
ru: небольшой снег
uk: невеликий сніг

source: scattered snow showers
ru: снегопад
uk: снігопад

source: snow showers
ru: снегопад
uk: снігопад

source: snow shower
ru: снег с дождём
uk: сніг з дощем

source: snowstorm
ru: метель
uk: заметіль

source: snowdrift
ru: сугробы
uk: замети

source: drifting snow
ru: заносы
uk: замети

source: wintry Mix
ru: дождь со снегом
uk: дощ зі снігом

source: ice to rain
ru: дождь со льдом
uk: дощ з льодом

source: ice
ru: на дорогах гололедица
uk: на дорогах ожеледиця

source: blizzard
ru: метель
uk: заметіль

source: blowing snow
ru: шквалы снега
uk: шквали снігу

source: snow
ru: снег
uk: сніг

source: light rain with thunder
ru: небольшой дождь с громом
uk: невеликий дощ з громом

source: few showers
ru: небольшой дождь
uk: невеликий дощ

source: heavy showers
ru: ливни
uk: зливи

source: heavy thunderstorms
ru: сильные грозы
uk: сильні грози

source: heavy thunderstorm
ru: сильная гроза
uk: сильна гроза

source: lightning
ru: молния
uk: блискавка

source: isolated clouds
ru: малооблачно
uk: хмарно з проясненнями

source: partly cloudy
ru: переменная облачность
uk: мінлива хмарність

source: partly bright
ru: частично ясное небо
uk: частково ясне небо

source: showers early
ru: утром дожди
uk: вранці дощі

source: light rain
ru: небольшой дождь
uk: невеликий дощ

source: heavy rain
ru: сильный дождь
uk: сильний дощ

source: isolated showers
ru: редкие дожди
uk: рідкісні дощі

source: isolated thunderstorms
ru: переменные грозы
uk: змінні грози

source: isolated thundershowers
ru: редкие грозы
uk: рідкісні грози

source: mostly cloudy
ru: преимущественно облачно
uk: переважно хмарно

source: mostly dry
ru: преимущественно сухо
uk: переважно сухо

source: mostly clear
ru: преимущественно ясно
uk: переважно ясно

source: clearing
ru: ясно
uk: ясно

source: no rain
ru: дождя не ожидается
uk: дощу не очікується

source: sleet
ru: дождь со снегом
uk: дощ зі снігом

source: blowing dust
ru: пыльная буря
uk: пилова буря

source: widespread dust
ru: пыль
uk: пил

source: low drifting sand
ru: низко дрейфующие пески
uk: низько дрейфуючі піски

source: sandstorm
ru: песчаная буря
uk: піщана буря

source: sand storm
ru: песчаная буря
uk: піщана буря

source: dust
ru: пыльная буря
uk: пилова буря

source: sand
ru: песчаная буря
uk: піщана буря

source: thundery showers
ru: грозовые ливни
uk: грозові зливи

source: thundershowers
ru: ливни
uk: зливи

source: scattered thunderstorms
ru: рассеянные грозы
uk: розсіяні грози

source: scattered showers
ru: дожди
uk: дощі

source: thunderstorms
ru: грозы
uk: грози

source: thunderstorm
ru: гроза
uk: гроза

source: storm
ru: буря
uk: буря

source: hail
ru: град
uk: град

source: foggy
ru: туманно
uk: туманно

source: fog
ru: туман
uk: туман

source: haze
ru: лёгкий туман
uk: легкий туман

source: mist
ru: лёгкий туман
uk: легкий туман

source: clear
ru: ясно
uk: ясно

source: fair
ru: ясно
uk: ясно

source: fine
ru: ясно
uk: ясно

source: overcast
ru: более
uk: більше

source: light showers
ru: небольшой дождь
uk: невеликий дощ

source: light drizzle
ru: небольшая морось
uk: невелика мряка

source: freezing rain
ru: холодный дождь
uk: холодний дощ

source: frequent showers
ru: частые ливни
uk: часті зливи

source: rain shower
ru: ливень
uk: злива

source: rain
ru: дождь
uk: дощ

source: freezing drizzle
ru: дождь со снегом
uk: дощ зі снігом

source: showers
ru: ливень
uk: злива

source: drizzle
ru: морось
uk: мряка

source: dry
ru: сухо
uk: сухо

source: mild
ru: мягкий
uk: м'який

source: clouds
ru: облачно
uk: хмарно

source: cloudy
ru: облачно
uk: хмарно

source: mostly sunny
ru: преимущественно ясно
uk: переважно ясно

source: sunny
ru: солнечно
uk: сонячно

source: sun
ru: солнечно
uk: сонячно

source: bright
ru: ясно
uk: ясно

source: thunder
ru: гром
uk: грім

source: shower
ru: ливень
uk: злива

source: breezy
ru: ветрено
uk: вітряно

source: blustery
ru: ветрено
uk: вітряно

source: windy
ru: ветрено
uk: вітряно

source: wind
ru: ветер
uk: вітер

source: flurries
ru: порывы
uk: пориви

source: late
ru: вечером
uk: ввечорі

source: early
ru: утром
uk: вранці

source: isolated
ru: редкие
uk: рідкісні

source: shallow fog
ru: стелющийся туман
uk: стелеться туман

source: heavy
ru: сильный
uk: сильний

source: cold
ru: холодный
uk: холодний

source: hot
ru: жаркий
uk: жаркий

source: Sorry, it was not possible to load the most recent update!
fi: Uusimman päivityksen lataaminen ei onnistunut.
hu: Nem sikerült betölteni a legújabb frissítést.
ru: К сожалению, не удалось загрузить самые последние обновления!
uk: На жаль, не вдалося завантажити останні оновлення!

source: Please try again later.
fi: Yritä myöhemmin uudelleen.
hu: Próbálkozzon később.
ru: Пожалуйста, повторите попытку позже.
uk: Будь ласка, спробуйте ще раз пізніше.

source: meters per second
fi: metriä sekunnissa
hu: méter per szekumdum
ru: метров в секунду
uk: метрів за секунду

source: Sorry, the woeID set is not valid or contains incomplete data!
ru: Извините, набор woeID недействителен или содержит неполные данные!К сожалению, woeID не действителен!
uk: Вибачте, набір woeID недійсний або містить неповні дані!

source: north
fi: pohjoinen
hu: északi
ru: северный
uk: північний

source: north northeast
fi: pohjois-koillinen
hu: észak-északkeleti
ru: северный, северо-восточный
uk: північний, північно-східний

source: northeast
fi: koillinen
hu: északkeleti
ru: северо-восточный
uk: північно-східний

source: east northeast
fi: itä-koillinen
hu: kelet-északkeleti
ru: восточный, северо-восточный
uk: східний, північно-східний

source: east
fi: itä
hu: keleti
ru: восточный
uk: східний

source: east southeast
fi: itä-kaakko
hu: kelet-délkeleti
ru: восточный, юго-восточный
uk: східний, південно-східний

source: southeast
fi: kaakko
hu: délkeleti
ru: юго-восточный
uk: південно-східний

source: south southeast
fi: etelä-kaakko
hu: dél-délkeleti
ru: южный, юго-восточный
uk: південний, південно-східний

source: south
fi: etelä
hu: déli
ru: южный
uk: південний

source: south southwest
fi: etelä-lounas
hu: dél-délnyugati
ru: южный, юго-западный
uk: південний, південно-західний

source: southwest
fi: lounas
hu: délnyugati
ru: юго-западный
uk: південно-західний

source: west southwest
fi: länsi-lounas
hu: nyugat-délnyugati
ru: западный, юго-западный
uk: західний, південно-західний

source: west
fi: länsi
hu: nyugati
ru: западный
uk: західний

source: west northwest
fi: länsi-luode
hu: nyugat-északnyugati
ru: западный, северо-западный
uk: західний, північно-західний

source: northwest
fi: luode
hu: északnyugati
ru: северо-западный
uk: північно-західний

source: north northwest
fi: pohjois-luode
hu: észak-északnyugati
ru: северный, северо-западный
uk: північний, північно-західний

source: Is not working properly, contains incomplete data or has been removed from the database of
ru: Не работает должным образом, содержит неполные данные или был удалён из базы данных
uk: Не працює належним чином, містить неповні дані або був видалений з бази даних

source: It could be a temporary problem and you may wait a while '...
fi: Ongelma voi olla tilapäinen, joten odota hetki.
hu: Ideiglenes hiba történhetett, várjon néhány percet '...
ru: Это может быть временной проблемой, подождите '...
uk: Це може бути тимчасовою проблемою, зачекайте '...

source: Do you want to delete it from your list?
fi: Haluatko poistaa sen luettelosta?
hu: Szeretné törölni a listáról?
ru: Вы действительно хотите удалить его из вашего списка?
uk: Ви дійсно бажаєте видалити його з вашого списку?

source: Provides the current temperature and weather conditions.
fi: Ilmoittaa nykyisen lämpötilan ja sääolosuhteet.
hu: Hőmérséklet és időjárási viszonyok lekérdezése
ru: Предоставляет сведения о текущей температуре и погодных условиях.
uk: Надає відомості про поточну температуру і погодні умови.

source: Provides the weather forecast and current temperature for 24 hours and the next 9 days.
ru: Предоставляет прогноз погоды и текущую температуру в течение 24 часов и в течении 9 дней.
uk: Надає прогноз погоди і поточну температуру протягом 24 годин і 9 днів.

source: Sorry, no list available!
fi: Luetteloa ei käytettävissä.
hu: Nincs elérhető lista!
ru: К сожалению, список не доступен!
uk: На жаль, список не доступний!

source: Allows you to set a temporary city.
fi: Mahdollistaa väliaikaisen kaupungin määrittämisen.
hu: Ideiglenes város kiválasztása
ru: Позволяет установить временный город.
uk: Дозволяє встановити тимчасовий місто.

source: Scale of temperature measurement set into
fi: Lämpötila-asteikoksi määritetty
hu: Hőmérsékleti skála beállítva
ru: Шкала измерения температуры в
uk: Шкала вимірювання температури в

source: Allows you to set a temporary scale of temperature mesurement.
fi: Mahdollistaa väliaikaisen lämpötila-asteikon määrittämisen.
hu: Ideiglenes hőmérsékleti skála beállítása
ru: Позволяет установить временную шкалу измерения температуры.
uk: Дозволяє встановити тимчасову шкалу вимірювання.

source: at
fi: kello
ru: в
uk: в

source: Last update of the current weather report
fi: Tämänhetkinen säätiedote päivitetty viimeksi
hu: Az időjárási adatok utolsó frissítése:
ru: Последнее обновление прогноза погоды
uk: Останнє оновлення прогнозу погоди

source: Announces the date of the last update of the weather report.
fi: Ilmoittaa säätiedotteen viimeisen päivityksen päivämäärän.
hu: Az időjárási adatok utolsó frissítésének lekérdezése
ru: Объявление даты последнего обновления погоды.
uk: Оголошення дати останнього оновлення погоди.

source: Open the Weather Plus settings dialog.
fi: Avaa Weather Plus:n asetusvalintaikkunan.
hu: A bővítmény beállításai
ru: Открывает диалог настроек Weather Plus.
uk: Відкриває діалог налаштувань Weather Plus.

source: f1: help placing, f2: last TAB selection, f3: list and edit box, f4: control duration Weather Forecast, f5: volume controls.
fi: F1: ohje, F2: viimeisimmän välilehden valinta, F3: luettelo- ja muokkausruutu, F4: muuta sääennusteen kestoa, F5: äänenvoimakkuuden säätimet.
hu: F1: Súgó, F2: utolsó kijelölt lapfül, F3: Lista és szerkesztőmező, F4: Előrejelzés napok száma, F5: Hangerő.
ru: f1: помощь размещения, f2: последний выбор TAB, f3: список и окно редактирования, f4: управление продолжительностью прогноза погоды, f5: управление громкостью.
uk: f1: допомога розміщення, f2: останній вибір TAB, f3: список і вікно редагування, f4: управління тривалістю прогнозу погоди, f5: управління гучністю.

source: f1: help placing, f2: last TAB selection, f3: list and edit box, f4: control duration Weather Forecast.
fi: F1: ohje, F2: viimeisimmän välilehden valinta, F3: luettelo- ja muokkausruutu, F4: muuta sääennusteen kestoa.
hu: F1: Súgó, F2: utolsó kijelölt lapfül, F3: Lista és szerkesztőmező, F4: Előrejelzés napok száma.
ru: f1: помощь размещения, f2: последний выбор TAB, f3: список и окно редактирования, f4: управление продолжительностью прогноза погоды.
uk: f1: допомога розміщення, f2: останній вибір TAB, f3: список і вікно редагування, f4: управління тривалістю прогнозу погоди.

source: Test
fi: Kokeile
hu: Ellenőrzés
ru: Тест
uk: Тест

source: Details
fi: Tiedot
hu: Részletek
ru: Подробности
uk: Подробиці

source: Define
fi: Määritä
hu: definiálás
ru: Определить
uk: Визначити

source: Add
fi: Lisää
hu: Hozzáadás
ru: Добавить
uk: Додати

source: Remove
fi: Poista
hu: Eltávolítás
ru: Удалить
uk: Видалити

source: Rename
fi: Nimeä uudelleen
hu: Átnevezés
ru: Переименовать
uk: Перейменувати

source: &Import new cities...
fi: Tuo &uusia kaupunkeja...
hu: Városok importálása...
ru: &Импортировать новые города...
uk: &Імпортувати нові міста...

source: &Export your cities...
fi: V&ie kaupungit...
hu: Városok exportálása...
ru: &Экспортировать города...
uk: &Експортувати міста...

source: Scale of temperature measurement:
fi: Lämpötila-asteikko:
hu: hőmérsékleti skála:
ru: Шкала измерения температуры:
uk: Шкала вимірювання температури:

source: Degrees shown as:
fi: Asteet näytetään muodossa:
hu: mértékegység megjelenítése:
ru: Показывать градусы в:
uk: Показувати градуси в:

source: Don't specify
ru: Не указывать
uk: Не вказувати

source: Weather Forecasts up to days:
fi: Sääennusteet näin monelle päivälle:
hu: Előrejelzett napok száma
ru: Прогноз погоды на число дней:
uk: Прогноз погоди на число днів:
