Repository: zstanecic/weather_plus
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fi, hu, ru, uk

source: &Copy the weather report and weather forecast, including city details to clipboard
fi: &Kopioi sääraportti ja -ennuste (kaupungin tiedot mukaan lukien) leikepöydälle
hu: Időjárás-előrejelzés másolása a vágólapra, a város részletes adataival együtt
ru: &Копировать метеосводку и прогноз погоды, включая сведения о городе в буфер обмена
uk: &Копіювати метеозведення і прогноз погоди, включаючи відомості про місто в буфер обміну

source: Enable &audio effects (only for the current weather conditions)
fi: Ota käyttöön &äänitehosteet (vain tämänhetkiselle säätilalle)
hu: &Hangeffektek az időjárási viszonyokhoz
ru: Включить &аудио эффекты (только для текущей погоды)
uk: Включити &аудіо ефекти (тільки для поточної погоди)

source: Use only &weather effects
fi: Käytä vain &säätehosteita
hu: Csak időjárási hangok
ru: Использовать только погодные эф&фекты
uk: Використовувати тільки погодні е&фекти

source: General audio volume
fi: Yleinen äänien voimakkuus
hu: Általános hangerő
ru: Общая громкость звука
uk: Загальна гучність звуку

source: Current audio volume
fi: Nykyinen äänien voimakkuus
hu: jelenlegi hangerő
ru: Текущая громкость звука
uk: Поточна гучність звуку

source: Enable &help buttons in the settings window
fi: Ota käyttöön &ohje-painikkeet asetusikkunassa
hu: Súgószövegek a gombokon
ru: Включить кнопки с &подсказками в окне настроек
uk: Включити кнопки з &підказками у вікні налаштувань

source: Read &wind informations
ru: Читать информацию о &ветре
uk: Читати інформацію про &вітер

source: Add wind directi&on
fi: Lisää tuulen suu&nta
hu: Szél&irány
ru: Добавить &направление ветра
uk: Додати &напрямок вітру

source: Add wi&nd speed
fi: Lisää tuu&len nopeus
hu: Szélsebesség
ru: Добавить скорость в&етра
uk: Додати швидкість в&ітру

source: Add speed in &meters per second of the wind
fi: Lisää tuulen nopeus &metreinä sekunnissa
hu: Szélsebesség méter per szekundumban
ru: Добавить &скорость ветра в метрах в секунду
uk: Додати &швидкість вітру в метрах за секунду

source: Add perceived &temperature
fi: Lisää tunnettu l&ämpötila
hu: Hőérzet
ru: Добавить воспринимаемую &температуру
uk: Додати сприйняту &температуру

source: &Read atmospherical informations
ru: Читать ат&мосферную информацию
uk: Читати ат&мосферную інформацію

source: Add humidity va&lue
fi: Lisää kosteus&arvo
hu: Páratartalom
ru: Добавить значение в&лажности
uk: Додати значення во&логості

source: Add &visibility value
fi: Lisää Nä&kyvyys
hu: Látótávolság
ru: Добавить значение видим&ости
uk: Додати значення видим&ості

source: Add atmospheric &pressure value
fi: Lisää ilman&paine
hu: Légnyomás
ru: Добавить значение атмосферного &давления
uk: &Додати значення атмосферного тиску

source: Indicates the atmospheric pressure in millimeters of mercur&y (mmHg)
fi: Ilmaisee ilmanpaineen elohopeamillimetreinä (mmHg)
hu: Légnyomás higanymilliméterben (mmHg)
ru: Указывать атмосферное давление в миллиметрах рт&утного столба (мм рт.ст.)
uk: Вказувати атмосферний тиск в міліметрах рт&утного стовпа (мм рт.ст.)

source: Add status of &barometric pressure
ru: Добавить состояние &барометрического давления
uk: Додати стан &барометричного тиску

source: Read a&stronomical informations
ru: Читать аст&рономическую информацию
uk: Читати аст&рономічну інформацію

source: Enable reading of the hours in &24-hour format
fi: Ota käyttöön ajan lukeminen &24 tunnin muodossa
hu: &Huszonnégy órás formátum
ru: Включить чтение часов в &24-часовом формате
uk: Включити читання годин в &24-годинному форматі

source: Use the comma to separate decimals, example (4,&15)
fi: Käytä pilkkua desimaalierottimena (esim. 4,&15)
hu: Tizedesvessző használata pont helyett, például (4,15)
ru: Использовать запятые для разделения десятичных знаков, пример (4,&15)
uk: Використовувати коми для розділення десяткових знаків, приклад (4,&15)

source: Check for &upgrade
fi: Tarkista &päivitykset
hu: &Frissítések keresése
ru: Провер&ять обновление
uk: Перевір&яти оновлення

source: Testing the validity of city woeID entry and find the name of city assigned, or viceversa.
ru: Проверка правильности введённого woeID города и поиск его назначенного названия или наоборот.
uk: Перевірка правильності введеного woeID міста і пошук його призначеної назви або навпаки.

source: Displays information on the current city.
ru: Отображает информацию о текущем городе.
uk: Показує інформацію про поточне місто.

source: Allows you to define the area, in order to adapt the sound effects.
fi: Mahdollistaa alueen määrittämisen äänitehosteiden mukauttamista varten.
hu: Megadható a régió típusa a hangeffektek hozzárendeléséhez.
ru: Позволяет определить местность, чтобы адаптировать звуковые эффекты.
uk: Дозволяє визначити місцевість, щоб адаптувати звукові ефекти.

source: Add the current city into your list.
fi: Lisää nykyinen kaupunki luetteloon.
hu: Hozzáadja a jelenlegi várost a listához.
ru: Добавить текущий город в свой список.
uk: Додати поточне місто в свій список.

source: Presets the current city as the default, will be used every time you restart the plugin.
fi: Määrittää nykyisen kaupungin oletukseksi, jolloin sitä käytetään aina kun käynnistät lisäosan uudelleen.
hu: Beállítja a jelenlegi várost alapértelmezett helyként, mindig ez fog megjelenni, amikor a bővítmény elindul.
ru: Настраивает текущий город по умолчанию. Будет использоваться каждый раз при перезапуске плагина.
uk: Налаштовує поточне місто за замовчуванням. Використовуватиметься після кожного перезапуску плагіна.

source: Delete the current city from your list.
fi: Poista nykyinen kaupunki luettelosta.
hu: Eltávolítja a jelenlegi várost a listáról.
ru: Удалить текущий город из списка.
uk: Видалити поточне місто зі списку.

source: Rename the current city.
fi: Nimeä nykyinen kaupunki uudelleen.
hu: Átnevezi a jelenlegi várost
ru: Переименовать текущий город.
uk: Перейменувати поточне місто.

source: Permits to incorporate in your list new cities importing them from another list with the extension *.zipcodes; you can select the city you want to import, by turning on the check box associated.
fi: Sisällyttää luetteloon uusia kaupunkeja tuomalla ne *.zipcodes-päätteisestä tiedostosta. Voit valita tuotavan kaupungin valitsemalla sen valintaruudun.
hu: Új városokat adhat hozzá *.zipcodes kiterjesztésű fájlokból. Csak azok a városok kerülnek fel a saját városok listájára, amiknél bejelöli a megfelelő jelölőnégyzetet.
ru: Позволяет включать в свой список новые города, импортируя их из другого списка с расширением *.zipcodes. Вы можете выбрать город, который хотите импортировать, установив соответствующий флажок.
uk: Дозволяє включати в свій список нові міста, імпортуючи їх з іншого списку з розширенням *.zipcodes. Ви можете вибрати місто, яке потрібно імпортувати, встановивши відповідний прапорець.

source: Permits to save your list of cities in a specified path.
fi: Tallentaa kaupunkiluettelon määritettyyn hakemistopolkuun.
hu: Elmenti a városlistát egy megadott fájlba.
ru: Позволяет сохранить ваш список городов по указанному пути.
uk: Дозволяє зберегти ваш список міст за зазначеним шляхом.

source: You can enter or search for a city
fi: Etsi kaupunki
hu: Városokat az alábbi módokon kereshet
ru: Вы можете ввести или найти город
uk: Ви можете ввести або знайти місто

source: By city woeID: 715399
ru: По woeID города: 715399
uk: За woeID міста: 715399

source: By only city name: Ferrara
ru: Только по названию города: Ferrara
uk: Тільки за назвою міста: Ferrara

source: By state or region and city name: Emilia Romagna Ferrara
ru: По стране или региону и названию города: Emilia Romagna Ferrara
uk: По країні або регіону і назві міста: Emilia Romagna Ferrara

source: By city name and country: Ferrara,it
ru: По названию города и страны: Ferrara,it
uk: За назвою міста і країни: Ferrara, it

source: By postal code: 44100,it
ru: По индексу: 44100,it
uk: За індексом: 44100, it

source: By geographic coordinates: latitude, longitude
ru: По географическим координатам: долгота, широта
uk: За географічними координатами: довгота, широта

source: If the city is not found
fi: Jos kaupunkia ei löydy
hu: Ha nem található a város az adatbázisban
ru: Если город не найден
uk: Якщо місто не найдено

source: Try with or without the country of origin
fi: Kokeile alkuperämaalla tai ilman sitä
hu: Próbálja meg az ország megadásával és anélkül
ru: Попробуйте с или без страны происхождения
uk: Спробуйте з, або без країни походження

source: Try to merge the name with hyphens, or separate it with spaces
ru: Попробуйте объединить имя с дефисом или разделить его пробелами
uk: Спробуйте об'єднати ім'я з дефісом або розділити його пробілами

source: Try deleting apostrophes
fi: Yritä poistaa heittomerkit
hu: Adja meg a nevet aposztrófok nélkül.
ru: Попробуйте удалить апостроф
uk: Спробуйте видалити апостроф

source: Try changing the vowels accented with normal vowels
fi: Yritä käyttää vain normaaleja vokaaleja aksenttimerkkejä sisältävien asemesta
hu: Cserélje le az ékezetes betűket ékezet nélküliekre.
ru: Попробуйте изменить гласные с ударением на нормальные гласные
uk: Спробуйте змінити голосні з наголосом на нормальні голосні

source: Try with a closest location
fi: Kokeile lähimmällä paikalla
hu: Keressen egy közeli helyet.
ru: Попробуйте ближайшее расположение
uk: Спробуйте найближче розташування

source: Help placing
fi: Ohje
hu: Segítség a hely megadásához
ru: Помощь размещения
uk: Допомога розміщення

source: No sound effect in memory!
fi: Äänitehosteita ei löydy
hu: Nincs hang betöltve a memóriába!
ru: Нет звукового эффекта в памяти!
uk: Немає звукового ефекту в пам'яті!

source: I can't reproduce the sound.
fi: Ääniä ei voitu toistaa.
hu: Nem tudom lejátszani a hangot.
ru: Я не могу воспроизвести звук.
uk: Я не можу відтворити звук.

source: not found! Press F1 for help on entering data.
fi: Ei löydy. Saat ohjeita tietojen syöttämisestä painamalla F1.
hu: Nem található! Az F1 billentyűvel segítséget kaphat az adatok megadásához.
ru: не найдено! Нажмите F1 для справки по вводу данных.
uk: не знайдено! Натисніть F1 для довідки щодо введення даних.

source: Is not working properly or has been removed from the database of
fi: Ei toimi oikein tai on poistettu tietokannasta lisäosassa
hu: Nem működik, vagy el lett távolítva az adatbázisból
ru: Не работает должным образом или был удалён из базы данных
uk: Чи не працює належним чином або був видалений з бази даних

source: Is no longer valid!
fi: Ei ole enää kelvollinen.
hu: Már nem érvényes!
ru: Больше не действует!
uk: Більше не діє!

source: This option requires the installation of some audio effects
fi: Tämä vaihtoehto edellyttää äänitehosteiden asentamista
hu: Ez a beállítás hangeffektek telepítését igényli.
ru: Эта настройка требует установки некоторых аудио эффектов
uk: Ця установка вимагає установки деяких аудіо ефектів

source: Do you want to install them?
fi: Haluatko asentaa ne?
hu: Szeretné feltelepíteni őket?
ru: Вы хотите установить их?
uk: Ви хочете встановити їх?

source: The audio effects are installed!
fi: Äänitehosteet on asennettu.
hu: A hangeffektek már telepítve vannak.
ru: Аудио эффекты установлены!
uk: Аудіо ефекти встановлені!

source: Would you like to update?
fi: Haluatko päivittää?
hu: Szeretné frissíteni?
ru: Вы хотите обновить?
uk: Ви бажаєте оновити?

source: Or do you want to uninstall them?
fi: Vai haluatko poistaa ne?
hu: Vagy inkább eltávolítaná őket?
ru: Или хотите удалить их?
uk: Або хочете видалити їх?

source: Are you sure you want to uninstall the sound effects?
fi: Haluatko varmasti poistaa äänitehosteet?
hu: Biztos, hogy eltávolítja a hangeffekteket?
ru: Вы уверены, что хотите удалить звуковые эффекты?
uk: Ви впевнені, що хочете видалити звукові ефекти?

source: Update in progress
fi: Päivitys käynnissä
hu: Frissítés folyamatban
ru: Прогресс обновления
uk: Йде оновлення

source: Installation in progress
fi: Asennus käynnissä
hu: Telepítés folyamatban
ru: Прогресс установки
uk: Прогрес установки

source: Please wait...
fi: Odota...
hu: Kérem várjon...
ru: Пожалуйста, подождите...
uk: Будь ласка, зачекайте...

source: The installation of audio effects has been completed successfully!
fi: Äänitehosteet on asennettu onnistuneesti.
hu: A hangefektek telepítése sikeresen befejeződött.
ru: Установка аудио эффектов успешно завершена!
uk: Установка аудіо ефектів успішно завершена!

source: Adding folder:
fi: Lisätään kansio:
hu: Mappa hozzáadása:
ru: Добавлена папка:
uk: Додана папка:

source: The upgrade of audio effects has been completed successfully!
fi: Äänitehosteet on päivitetty onnistuneesti.
hu: A hangok frissítése sikeresen megtörtént!
ru: Обновление аудио эффектов успешно завершено!
uk: Оновлення аудіо ефектів успішно завершено!

source: These sound effects are subject to change by the author.
fi: Tekijä voi muuttaa näitä äänitehosteita.
hu: A hangok változtatásának jogát a szerző fenntartja.
ru: Эти звуковые эффекты могут быть изменены автором.
uk: Ці звукові ефекти можуть бути змінені автором.

source: Disable and re-enable this option in order to update or uninstall them.
fi: Päivitä tai poista ne poistamalla tämä asetus käytöstä ja ottamalla se uudelleen käyttöön.
hu: Kapcsolja ki majd aktiválja újra a beállítást, hogy eltávolítsa, telepítse, vagy frissítse őket.
ru: Отключить и снова включить этот параметр, чтобы обновить или удалить их.
uk: Відключити і знову включити цей параметр, щоб оновити або видалити їх.

source: Verify that your internet connection is active, or try again later.
fi: Varmista, että internet-yhteytesi on käytössä tai yritä myöhemmin uudelleen.
hu: Ellenőrizze, hogy van-e internetkapcsolat, és próbálja újra.
ru: Убедитесь, что подключение к интернету активно или повторите попытку позже.
uk: Переконайтеся, що підключення до інтернету активно або спробуйте ще раз.

source: File corrupted or not available!
fi: Tiedosto vahingoittunut tai ei käytettävissä.
hu: a Fájl sérült vagy nem érhető el!
ru: Файл повреждён или не доступен!
uk: Файл пошкоджений або не доступний!

source: Sorry, i could not complete the installation of the sound effects!
ru: К сожалению, закончить установку звуковых эффектов невозможно!
uk: На жаль, закінчити установку звукових ефектів неможливо!

source: Installation Error!
fi: Asennusvirhe
hu: Telepítési hiba!
ru: Ошибка Установки!
uk: Помилка Установки!

source: The details of this city are not in the database and so I added them to the list. Try again!
ru: Сведения об этом городе отсутствуют в базе данных, поэтому я добавил их в список. Попробуйте снова!
uk: Відомості про це місто відсутні в базі даних, тому я додав їх до списку. Спробуйте знову!

source: Cannot identify your location, due to insufficient data.
fi: Sijaintiasi ei tunnistettu riittämättömien tietojen vuoksi.
hu: Nem lehet a helyet meghatározni, az adatok nem megfelelőek.
ru: Невозможно определить местоположение из-за недостатка данных.
uk: Неможливо визначити місце розташування через нестачу даних.

source: Daylight saving time
ru: Переход на летнее время
uk: Перехід на літній час

source: ahead
ru: вперёд
uk: вперед

source: back
ru: назад
uk: назад

source: Starts on
ru: Начинается
uk: Починається

source: set your clock
ru: переведите ваши часы на
uk: переведіть ваші годинники на

source: hour
ru: час
uk: годину

source: Ends on
ru: Заканчивается
uk: Закінчується

source: Details of
fi: Tiedot kohteesta
hu: Részletek
ru: Подробности
uk: Подробиці

source: Place
fi: Paikka
hu: Hely
ru: Место
uk: Місце

source: Current local time
fi: Paikallinen aika
hu: Helyi idő
ru: Текущее местное время
uk: Поточний місцевий час

source: Degrees latitude
fi: Leveysaste
hu: Szélességi fok
ru: Градусов северной широты
uk: Градусів північної широти

source: Degrees longitude
fi: Pituusaste
hu: Hosszúsági fok
ru: Градусов долготы
uk: Градусів довготи

source: Elevation above sea level
fi: Korkeus merenpinnasta
hu: Tengerszint feletti magasság
ru: Высота над уровнем моря
uk: Висота над рівнем моря

source: meters
fi: metriä
hu: méter
ru: метров
uk: метрів

source: Define the area for
fi: Määritä alue kohteelle
hu: A környék...
ru: Определить местность для
uk: Визначити місцевість для

source: Hinterland
fi: Sisämaa
hu: Hátország
ru: Внутренние районы страны
uk: Внутрішні райони країни

source: Maritime area
fi: Merialue
hu: Tengerpart
ru: Море
uk: Море

source: Desert zone
fi: Aavikkovyöhyke
hu: Sivatag
ru: Пустыня
uk: Пустеля

source: Arctic zone
fi: Arktinen alue
hu: Sarkvidék
ru: Арктика
uk: Арктика

source: Mountain zone
fi: Vuoristoalue
hu: Hegyvidék
ru: Горы
uk: Гори

source: Enter new name.
fi: Syötä uusi nimi.
hu: Adjon meg új nevet.
ru: Введите новое имя.
uk: Введіть нове ім'я.

source: it can't be used because it already exists!
fi: Antamasi nimi on jo käytössä.
hu: Nem használható, mert már létezik ilyen!
ru: его нельзя использовать, т.к. оно уже существует!
uk: його не можна використовувати, тому що воно вже існує!

source: is correct
fi: on oikein
hu: Helyes
ru: правильно
uk: правильно

source: But the name
fi: mutta nimi
hu: De a név
ru: Но название
uk: Але назва

source: already exists
fi: on jo käytössä
hu: Már létezik
ru: уже существует
uk: вже існує

source: You have to change it!
fi: Sinun on muutettava sitä.
hu: Meg kell változtatni
ru: Вы должны его изменить!
uk: Ви повинні її змінити!

source: The city proper is
fi: Oikea kaupunki on
hu: A város helyes neve
ru: Город находится
uk: Місто знаходиться

source: Want to use the suggested name?
fi: Haluatko käyttää ehdotettua nimeä?
hu: Szeretné használni a javasolt nevet?
ru: Хотите использовать предложенное имя?
uk: Бажаєте використовувати запропоноване ім'я?

source: Import cities
fi: Tuo kaupungit
hu: Városok importálása
ru: Импорт городов
uk: Імпорт міст

source: Do you want to replace your list with this?
fi: Haluatko korvata luettelosi tällä?
hu: Szeretné ezzel lecserélni a listáját?
ru: Вы хотите заменить свой список этим?
uk: Ви бажаєте замінити свій список цим?

source: If you select yes, your list will be completely replaced.
fi: Jos valitset kyllä, luettelo korvataan kokonaan.
hu: Ha az igent választja, a listája teljesen kicserélődik.
ru: Если вы выберите Да, то ваш список будет полностью заменён.
uk: Якщо ви оберете Так, то ваш список буде повністю замінений.

source: If you select no, the new cities will be added to your list.
fi: Jos valitset ei, uudet kaupungit lisätään luetteloon.
hu: Ha a nemet, az új városok hozzá lesznek adva a listájához.
ru: Если вы выберите Нет, новые города будут добавлены в ваш список.
uk: Якщо ви оберете Ні, нові міста будуть додані в ваш список.

source: Select import mode
fi: Valitse tuonnin tila
hu: Importálási mód kiválasztása
ru: Выберите режим импорта
uk: Виберіть режим імпорту

source: File contents
fi: Tiedoston sisältö
hu: fájl tartalma
ru: Содержимое файла
uk: Вміст файлу

source: cities
fi: Kaupungit
hu: városok
ru: городов
uk: міст

source: Activate the check boxes of the cities you want to import.
fi: Valitse valintaruuduilla ne kaupungit, jotka haluat tuoda.
hu: Jelölje be az importálni kívánt városok jelölőnégyzeteit.
ru: Отметьте флажки городов, которые хотите импортировать.
uk: Відзначте прапорці міст, які потрібно імпортувати.

source: Importing cities in progress
fi: Kaupunkien tuonti käynnissä
hu: A városok importálása folyamatban van
ru: Выполняется импорт городов
uk: Виконується імпорт міст

source: Were added
fi: Lisättiin
hu: Hozzáadtam
ru: Было добавлено
uk: Було додано

source: new cities to the list
fi: luetteloon uusia kaupunkeja
hu: Új városokat a listához
ru: новых городов в список
uk: нових міст в список

source: Have been ignored because existing
fi: Ohitettu, koska jo olemassa
hu: Kihagytam, mert már létezik
ru: Было проигнорировано, поскольку существуют
uk: Було проігноровано, оскільки існують

source: Content of imported list
fi: Tuodun luettelon sisältö
hu: Az importált lista tartalma
ru: Содержание импортированного списка
uk: Зміст імпортованого списку

source: selected by the user
fi: käyttäjän valitsema
hu: A felhasználó kijelölései
ru: выбранные пользователем
uk: вибрані користувачем

source: Import finished
fi: Tuonti valmis
hu: Az importálás befejeződött
ru: Импорт завершён
uk: Імпорт закінчен

source: A copy of
fi: Kopio
hu: másolatát
ru: Копия
uk: Копія

source: It will be exported
fi: Se viedään.
hu: Exportálni fogom kijelölve
ru: Будет экспортирован
uk: Буде експортований

source: But it does not yet contain the changes you just made the list!
fi: Se ei kuitenkaan sisällä luetteloon tekemiäsi muutoksia.
hu: de Nem tartalmazza a listáján mostanában végzett változtatásokat
ru: Но ещё не содержит внесённые изменения в списке!
uk: Але ще не містить внесені зміни в списку!

source: I proceed?
fi: Jatketaanko?
hu: Folytassam?
ru: Продолжить?
uk: Продовжити?

source: Export cities
fi: Vie kaupungit
hu: Városok exportálása
ru: Экспорт городов
uk: Експорт міст

source: You can not export the same file at the same path!
fi: Samaa tiedostoa ei voi viedä samaan hakemistopolkuun.
hu: Ugyanazt a fájlt nem mentheti ugyanabba a mappába!
ru: Вы не можете экспортировать тот же файл по тому же пути!
uk: Ви не можете експортувати той же файл за тим самим шляхом!

source: january
fi: tammikuu
hu: január
ru: января
uk: січня

source: february
fi: helmikuu
hu: február
ru: февраля
uk: лютого

source: march
fi: maaliskuu
hu: március
ru: марта
uk: березня

source: april
fi: huhtikuu
hu: április
ru: апреля
uk: квітня

source: may
fi: toukokuu
hu: május
ru: мая
uk: травня

source: june
fi: kesäkuu
hu: június
ru: июня
uk: червня

source: july
fi: heinäkuu
hu: július
ru: июля
uk: липня

source: august
fi: elokuu
hu: augusztus
ru: августа
uk: серпня

source: september
fi: syyskuu
hu: szeptember
ru: сентября
uk: вересня

source: october
fi: lokakuu
hu: október
ru: октября
uk: жовтня

source: november
fi: marraskuu
ru: ноября
uk: листопада

source: december
fi: joulukuu
ru: декабря
uk: грудня

source: Monday
fi: maanantai
hu: Hétfő
ru: В понедельник
uk: В понеділок

source: Tuesday
fi: tiistai
hu: Kedd
ru: Во вторник
uk: У вівторок

source: Wednesday
fi: keskiviikko
hu: Szerda
ru: В среду
uk: У середу

source: Thursday
fi: torstai
hu: Csütörtök
ru: В четверг
uk: У четвер

source: Friday
fi: perjantai
hu: Péntek
ru: В пятницу
uk: У п'ятницю

source: Saturday
fi: lauantai
hu: Szombat
ru: В субботу
uk: У суботу

source: Sunday
fi: sunnuntai
hu: Vasárnap
ru: В воскресенье
uk: У неділю

source: It was not possible find the acronym of %s!
ru: Не удалось найти аббревиатуру %s!
uk: Не вдалося знайти абревіатуру %s!

source: This does not allow to get the city local time, the sound effects will not be consistent.
ru: Невозможно получить городское местное время, звуковые эффекты не будут согласованными.
uk: Неможливо отримати міський місцевий час, звукові ефекти не будуть узгодженими.

source: Please report this to the author so he can add this country in database.
fi: Ilmoita tästä kehittäjälle, jotta maa voidaan lisätä tietokantaan.
hu: Kérem jelezze a fejlesztőnek, hogy hozzáadhassa ezt az országot az adatbázishoz.
ru: Пожалуйста, сообщите об этом автору, чтобы он мог добавить эту страну в базу данных.
uk: Будь ласка, повідомте про це автору, щоб він міг додати цю країну в базу даних.

source: Send an email to %s
fi: Lähetä sähköpostia osoitteeseen %s
hu: E-mail küldése a %s címre.
ru: Отправте письмо на %s
uk: Відправте лист на %s

source: With object the line below, thanks.
fi: ja sisällytä siihen alla oleva rivi. Kiitos.
hu: tárgyként az alábbi sort adja meg, köszönöm.
ru: С объектом строки ниже, спасибо.
uk: З об'єктом рядку нижче, спасибі.

source: Downloaded
fi: Ladattu
hu: Letöltve
ru: Загружено
uk: Завантажено

source: of
ru: из
uk: з

source: Find...
fi: Etsi...
hu: Keresés...
ru: Найти...
uk: Знайти...

source: Find next
fi: Etsi seuraava
hu: Következő keresése
ru: Найти Следующую
uk: Знайти Наступну
